{
  "citation": "@article{REYESORTIZ2016754,\ntitle = \"Transition-Aware Human Activity Recognition Using Smartphones\",\njournal = \"Neurocomputing\",\nvolume = \"171\",\npages = \"754 - 767\",\nyear = \"2016\",\nissn = \"0925-2312\",\ndoi = \"https://doi.org/10.1016/j.neucom.2015.07.085\",\nurl = \"http://www.sciencedirect.com/science/article/pii/S0925231215010930\",\nauthor = \"Jorge-L. Reyes-Ortiz and Luca Oneto and Albert Samà and Xavier Parra and Davide Anguita\",\nkeywords = \"Activity Recognition, Smartphones, Transitions, Support Vector Machines, Machine learning\",\nabstract = \"This work presents the Transition-Aware Human Activity Recognition (TAHAR) system architecture for the recognition of physical activities using smartphones. It targets real-time classification with a collection of inertial sensors while addressing issues regarding the occurrence of transitions between activities and unknown activities to the learning algorithm. We propose two implementations of the architecture which differ in their prediction technique as they deal with transitions either by directly learning them or by considering them as unknown activities. This is accomplished by combining the probabilistic output of consecutive activity predictions of a Support Vector Machine (SVM) with a heuristic filtering approach. The architecture is validated over three case studies that involve data from people performing a broad spectrum of activities (up to 33), while carrying smartphones or wearable sensors. Results show that TAHAR outperforms state-of-the-art baseline works and reveal the main advantages of the architecture.\"\n}",
  "description": "===================================================================================================\nSmartphone-Based Recognition of Human Activities and Postural Transitions Data Set\nVersion 2.1\n===================================================================================================\nJorge L. Reyes-Ortiz(1,2), Davide Anguita(1), Luca Oneto(1) and Xavier Parra(2)\n1 - Smartlab, DIBRIS - Universit‡  degli Studi di Genova, Genoa (16145), Italy. \n2 - CETpD - Universitat PolitËcnica de Catalunya. Vilanova i la Geltr˙ (08800), Spain\nhar '@' smartlab.ws \nwww.smartlab.ws\n===================================================================================================\nThe experiments were carried out with a group of 30 volunteers within an age bracket of 19-48 years. They performed a protocol of activities composed of six basic activities: three static postures (standing, sitting, lying) and three dynamic activities (walking, walking downstairs and walking upstairs). The experiment also included postural transitions that occurred between the static postures. These are: stand-to-sit, sit-to-stand, sit-to-lie, lie-to-sit, stand-to-lie, and lie-to-stand. All the participants were wearing a smartphone (Samsung Galaxy S II) on the waist during the experiment execution. We captured 3-axial linear acceleration and 3-axial angular velocity at a constant rate of 50Hz using the embedded accelerometer and gyroscope of the device. The experiments were video-recorded to label the data manually. The obtained dataset was randomly partitioned into two sets, where 70% of the volunteers was selected for generating the training data and 30% the test data. \n\nThe sensor signals (accelerometer and gyroscope) were pre-processed by applying noise filters and then sampled in fixed-width sliding windows of 2.56 sec and 50% overlap (128 readings/window). The sensor acceleration signal, which has gravitational and body motion components, was separated using a Butterworth low-pass filter into body acceleration and gravity. The gravitational force is assumed to have only low frequency components, therefore a filter with 0.3 Hz cutoff frequency was used. From each window, a vector of 561 features was obtained by calculating variables from the time and frequency domain. See 'features_info.txt' for more details. \n\nThis dataset is an extended version of the UCI Human Activity Recognition Using smartphones Dataset that can be found at: https://archive.ics.uci.edu/ml/datasets/Human+Activity+Recognition+Using+Smartphones\nThis version provides the original raw inertial signals from the smartphone sensors, instead of the ones pre-processed into windows which were provided in version 1. This change was done in order to be able to make online tests with the data. Moreover, the activity labels were updated in order to include postural transitions that were not part of the previous version of the dataset. \n\nNotes: \n======\n- Features are normalized and bounded within [-1,1].\n- Each feature vector is a row on the 'X' and 'y' files.\n- The units used for the accelerations (total and body) are 'g's (gravity of earth -> 9.80665 m/seg2).\n- The gyroscope units are rad/seg.\n- A video of the experiment including an example of the 6 recorded activities with one of the participants can be seen in the following link: http://www.youtube.com/watch?v=XOEN9W05_4A\n\nFor more information about this dataset please contact har '@' smartlab.ws or check our website www.smartlab.ws",
  "downloadSize": "79596192",
  "location": {
    "urls": [
      "https://archive.ics.uci.edu/ml/datasets/Smartphone-Based+Recognition+of+Human+Activities+and+Postural+Transitions"
    ]
  },
  "name": "hapt",
  "splits": [
    {
      "name": "test",
      "numBytes": "294176",
      "shardLengths": [
        "5072"
      ]
    },
    {
      "name": "train",
      "numBytes": "963032",
      "shardLengths": [
        "16604"
      ]
    },
    {
      "name": "val",
      "numBytes": "136880",
      "shardLengths": [
        "2360"
      ]
    }
  ],
  "supervisedKeys": {
    "input": "sensor",
    "output": "label"
  },
  "version": "1.0.0"
}