Model: "vgg_like"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, None, None, 3)]   0         
_________________________________________________________________
conv2d (Conv2D)              (None, None, None, 8)     224       
_________________________________________________________________
batch_normalization (BatchNo (None, None, None, 8)     32        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, None, None, 8)     584       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, None, None, 8)     0         
_________________________________________________________________
batch_normalization_1 (Batch (None, None, None, 8)     32        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, None, None, 16)    1168      
_________________________________________________________________
batch_normalization_2 (Batch (None, None, None, 16)    64        
_________________________________________________________________
conv2d_3 (Conv2D)            (None, None, None, 16)    2320      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, None, None, 16)    0         
_________________________________________________________________
batch_normalization_3 (Batch (None, None, None, 16)    64        
_________________________________________________________________
conv2d_4 (Conv2D)            (None, None, None, 32)    4640      
_________________________________________________________________
batch_normalization_4 (Batch (None, None, None, 32)    128       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, None, None, 32)    9248      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, None, None, 32)    0         
_________________________________________________________________
batch_normalization_5 (Batch (None, None, None, 32)    128       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, None, None, 64)    18496     
_________________________________________________________________
batch_normalization_6 (Batch (None, None, None, 64)    256       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, None, None, 64)    36928     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, None, None, 64)    0         
_________________________________________________________________
batch_normalization_7 (Batch (None, None, None, 64)    256       
_________________________________________________________________
global_average_pooling2d (Gl (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 128)               8320      
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258       
=================================================================
Total params: 83,146
Trainable params: 82,666
Non-trainable params: 480
_________________________________________________________________